Revit 2025 API
FabricSheetAlignment Enumeration
 Fabric Sheet alignment in the fabric distribution
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricSheetAlignment
Public Enumeration FabricSheetAlignment
public enum class FabricSheetAlignment
type FabricSheetAlignment
Members
Member name | Value | Description
Null | 0 |  The fabric sheets are alignment is not set.
StartingEdge | 1 |  The fabric sheets are aligned to starting edge.
EndingEdge | 2 |  The fabric sheets are aligned to ending edge.
BothEdges | 3 |  The fabric sheets are aligned to starting and ending edge.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace